Autodesk.Revit.DB.Material.SetMaterialAspectByPropertySet(Autodesk.Revit.DB.MaterialAspect,Autodesk.Revit.DB.ElementId)
Sets an aspect of the material to a shared property set.
aspect:
The material aspect.
propertySetId:
Identifier of a shared property set (an instance of PropertySetElement).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Material.Duplicate(System.String)
Duplicates the material
Remarks:
If duplication fails for reasons unrelated to the name, null will be returned.
name:
Name of the new material - this name must be correctly structured for Revit use and not duplicate the name
of another material in the document.
Returns:
The new material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a material element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Material.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
Validates whether the material name is unique in document.
aDocument:
The document in which the name is being tested for uniqueness.
name:
The name tested for uniqueness.
Returns:
Returns true if the name is unique, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Material.IsMaterialOrValidDefault(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Validates whether the specified element id is a material element.
pElem:
An element which will be applied the material
materialId:
The element id to be checked.
Returns:
True if the element a material element or invalidElementId, which means take material from category, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Material.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new material.
document:
The document in which to create the material.
name:
The name of the new material.
Returns:
Identifier of the new material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a material element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Material.MaterialCategory
The name of the material category, e.g. 'Wood'
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Material.MaterialClass
The name of the general material type, e.g. 'Wood.'
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Material.ThermalAssetId
The ElementId of the thermal PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Material.StructuralAssetId
The ElementId of the structural PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Material.AppearanceAssetId
The ElementId of the AppearanceAssetElement.
Remarks:
This is the id to the element that contains visual material information used for rendering.
In some cases where the material is created without setting up custom render appearance properties
(for example, when the material is created via an import, or when it is created by the API),
this property will be InvalidElementId.  In that situation the standard material properties such as
Autodesk.Revit.DB.Material.Color and Autodesk.Revit.DB.Material.Transparency will dictate the appearance of the material during rendering.
The id of the AppearanceAssetElement, or InvalidElementId if the material does not have an associated
appearance asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Material.SurfaceBackgroundPatternId
The id of the FillPatternElement used as the background pattern of faces with this material in normal views.
Remarks:
The FillPattern used for a background pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.CutBackgroundPatternId
The id of the FillPatternElement used as the background pattern of faces with this material in cut views.
Remarks:
The FillPattern used for a cut pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.SurfaceForegroundPatternId
The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.
Remarks:
The FillPattern used for a surface foreground pattern can have a 'Drafting' or a 'Model' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.CutForegroundPatternId
The id of the FillPatternElement used as the foreground pattern of faces with this material in cut views.
Remarks:
The FillPattern used for a cut foreground pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.CutBackgroundPatternColor
The color of the material cut background pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.SurfaceBackgroundPatternColor
The color of the material surface background pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.CutForegroundPatternColor
The color of the material cut foreground pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.SurfaceForegroundPatternColor
The color of the material surface foreground pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Material.Color
The color of the material.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null